reo-sato/pokerapp/firmware/esp32s3-pn5180-ccid/sdkconfig.defaults
# ESP32-S3 + TinyUSB(CCID) 既定 sdkconfig。idf.py reconfigure で反映される。
# 実機・IDF バージョンに応じて menuconfig で調整すること。

CONFIG_IDF_TARGET="esp32s3"

# --- USB: native USB-OTG を TinyUSB で使う（CP2102N の UART 側ではない！ §0） ---
CONFIG_TINYUSB_ENABLED=y
# アプリ独自クラス(CCID)を usbd_app_driver_get_cb() で登録するため、組込みクラスは無効でよい。
CONFIG_TINYUSB_CDC_ENABLED=n
CONFIG_TINYUSB_MSC_ENABLED=n
CONFIG_TINYUSB_HID_ENABLED=n
# TinyUSB のタスク/ログ
CONFIG_TINYUSB_NO_DEFAULT_TASK=n

# USB を native(internal PHY) に固定（外部 PHY を使わない）。
CONFIG_USB_OTG_SUPPORTED=y

# --- FreeRTOS / ログ ---
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# --- フラッシュ/PSRAM はモジュールに合わせて menuconfig で（既定は触らない） ---
